{
  "jobs": [
    {
      "id": "4234785249",
      "title": "AI/ML Engineer",
      "company": "Blueprint",
      "location": "Blueprint\n              \n\n\n              Canada",
      "description": "About BlueprintAt Blueprint, we're on a mission to empower therapists with world-class tools so they can focus on what matters most—delivering exceptional mental health care.Our AI assistant is purpose-built for therapists, automating the administrative tasks that slow them down and enabling them to operate at the top of their license. With Blueprint, therapists aren't just managing their work; they're supported by tools that understand the context of each client interaction. Compared to legacy software tools, Blueprint feels more like having the world's best executive assistant at your side.Today, over 50,000 therapists are on Blueprint, leveraging our platform to enhance care for hundreds of thousands of clients. We've found strong product-market fit and are scaling rapidly to meet demand.Our organization is very flat and our team is intentionally small and talent-dense. We like people who are truthseekers, creative, and passionate about improving mental health care.We're a remote-first company (US and Canada only, for now) and come together in person a few times a year to connect, have fun, and help shape the future of mental health care.About The RoleWe're looking for an experienced AI/ML Engineer to take ownership of evaluation and quality across our AI systems. At Blueprint, AI isn't a bolt-on — it's the foundation of our product. We use LLMs to automate clinical documentation, deliver clinical insights, and reimagine how therapists work.This role is about making sure those systems work reliably, safely, and well. You'll design the evaluation infrastructure that helps us measure what \"good\" looks like across subjective, human-centered workflows and build the tools to track, test, and improve model outputs over time.You'll work closely with engineering, product, and clinical leaders to define quality in practical, therapist-facing terms and make sure we have the systems in place to deliver it consistently.This is a highly cross-functional, high-impact role. Your work will directly shape what tens of thousands of therapists experience when they use our product every day.What You'll DoDesign and build our end-to-end evaluation infrastructure: LLM-as-a-judge, human QA pipelines, offline scoring, and moreDefine and implement application-specific quality metrics — not just accuracy, but tone, structure, clinical alignment, and moreCollaborate with product and clinical leads to turn subjective requirements into structured evaluation criteriaMonitor and analyze model performance across different therapist cohorts and workflowsBuild tools and processes to capture in-the-wild feedback from clinicians and route it back into model and product improvement loopsWork closely with engineers to integrate eval into our CI, deployment, and iteration cyclesHelp shape data labeling, prompt evaluation, experiment design, and prompt tuning frameworksWho We're Looking ForYou're a hands-on ML/AI practitioner who's passionate about building high-quality systems that actually get used — not just optimizing for benchmark scores. You've worked with LLMs in production at scale and know the hard part is making outputs reliable, human-aligned, and easy to evaluate. You're motivated by impact, comfortable with ambiguity, and thrive in early-stage, fast-paced environments.You might be a fit if:You've built or owned evaluation infrastructure for LLMs or generative AI productsYou have experience designing QA workflows, human-in-the-loop systems, or LLM-as-a-judge pipelinesYou think in terms of feedback loops — and can turn fuzzy product goals into testable quality metricsYou write code, ship experiments, and are comfortable working across the stack to get the right signals flowingYou're excited about working closely with product, design, and domain experts to define and refine what \"good\" means in a real-world AI applicationBonus if you have:Experience in healthcare, mental health, or other high-trust environmentsFamiliarity with labeling, data QA, or prompt engineering at scaleA strong POV on eval tools, metrics, or best practices — and a willingness to invent new ones where neededBenefitsCompetitive salary and equity100% remote - no office, no commutingHealth, dental, and vision insurance, with 75% of your premium covered by BlueprintSemi-annual team gatherings (in Chicago!)Unlimited PTOOpportunities to grow with the company and shape our productHardworking, mission-driven, friendly coworkersBlueprint is an equal opportunity employer and does not discriminate on the basis of race, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition, or any other basis protected by law.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "application_url": "https://www.linkedin.com/jobs/view/4234785249",
      "seniority_level": "Entry level"
    },
    {
      "id": "4213691564",
      "title": "Data Scientist",
      "company": "Kerry Search Partners",
      "location": "Kerry Search Partners\n              \n\n\n              Canada",
      "description": "🚀 Data Scientist – Web3 | DeFi | AI Automation📍 Location: Remote (Vancouver preferred)Are you passionate about Web3 and excited to work at the cutting edge of AI automation and decentralized finance? We’re looking for a Data Scientist who thrives in ambiguity, loves taking ownership, and wants to push the boundaries of what’s possible in crypto analytics and quantitative finance.What You’ll DoBuild and deploy financial models that turn noisy on-chain data into clear, actionable insights.Develop risk scoring, trading signals, and P&L models for live markets—especially in DeFi.Automate data pipelines and analytics workflows using emerging AI tools and frameworks.Collaborate closely with PMs and engineers to define product metrics and drive roadmap priorities.Lead projects from prototype to production—owning design, implementation, monitoring, and iteration.Communicate your findings clearly to technical and non-technical audiences alike.What We’re Looking ForWeb3 Passion: You’ve contributed to DeFi ecosystems via code, research, writing, or community involvement.AI-First Mindset: You’ve used AI/ML to automate data workflows end-to-end, and are excited about new tools like LLMs and agent-based systems.Statistical Fluency: You know your way around time-series, probability, causal inference, and anomaly detection.Quant Finance Know-How: You’ve built models around P&L, risk, or trading strategies and understand instruments like perpetuals, swaps, and lending protocols.Builder Mentality: You’ve shipped projects in fast-paced environments with minimal guidance. You bias toward action.Product & Communication Skills: You translate business needs into metrics and data solutions, and you can explain your thinking clearly—whether to a PM or a founder.Tech We UseLanguages: Python, SQL, TypeScriptTools: Airflow, ClickHouse, BigQuery, Jupyter, dbt, PlotlyInfra: GCP, Solana, FastAPI, Docker, LangChain, OpenAI APIsBonus PointsExperience building dashboards or observability tools for analytics featuresFamiliarity with on-chain execution and smart contract dataPrior work in an early-stage startup or DeFi protocol\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "application_url": "https://www.linkedin.com/jobs/view/4213691564",
      "seniority_level": "Mid-Senior level"
    },
    {
      "id": "4233827862",
      "title": "Machine Learning Scientist",
      "company": "Perceptive Space",
      "location": "Perceptive Space\n              \n\n\n              Canada",
      "description": "Perceptive Space Systems is building a decision intelligence platform to help satellite and launch operators navigate the growing risks posed by space weather and the space environment. We work at the intersection of aerospace, AI, and real-time systems, combining cutting-edge modeling, sensor fusion, and autonomy to improve operational resilience in orbit. Read more here.Join us at the frontier of space technology and AIYou will build the foundational technology required for satellites, launch vehicles, and human missions to operate safely and efficiently in the harsh space environmentAs part of our small, high-velocity team, you'll work at the intersection of aerospace, autonomy, and applied AI, solving real-world challenges with immediate mission impact.This role is ideal for entrepreneurial engineers who want to build from first principles, move fast, and own core systems end-to-end and who take initiative, thrive in ambiguity, and be part of a demanding startup environment.What You'll DoBuild and evaluate machine learning models for time series forecasting and spatio-temporal dynamicsDesign experiments to assess model generalization, uncertainty, and relevance to physical systemsIntegrate domain knowledge, external signals, or prior constraints to improve model performanceOptimize model performance through feature engineering, architecture tuning, and validation strategiesCollaborate with aerospace engineers, software engineers, and domain experts to deploy ML systems in productionStay up to date with developments in ML for dynamic systems, forecasting, and scientific MLRequirements4+ years of industry experience following a Master's or PhD in Physics, Electrical Engineering, Applied Math, or a related field Experience in fast-paced, high-ownership ML roles within a startup or a fast-moving, demanding startup-like environmentProficient in Python and experienced with deep learning frameworks such as PyTorch or TensorFlowExperienced with tools and frameworks like MLflow, Ray, Dask, and NumbaStrong background in modeling temporal or sequential data (e.g., time series forecasting, state-space models, signal processing)Comfortable working with multidimensional datasets and integrating domain context into modelingStrong general foundations in software engineering, including coding standards, code reviews, source control (e.g., Git), build processes, and testingExperience deploying ML solutions onto cloud platforms (e.g., AWS, GCP, Azure)Track record of contributing to the successful delivery of production-ready ML modelsAble to explain model behavior, assumptions, and limitations clearly to both technical and non-technical stakeholdersExcellent communication and collaboration skills; able to work effectively across disciplinesBonus If You HaveExperience working in early-stage or cross-disciplinary R&D teamsExperience working on scientific modeling, simulation data, or systems governed by physics or control principlesFamiliarity with techniques for uncertainty quantification and physics-informed MLA track record of publications or contributions to open-source ML librariesProficient in C/C++ and JavaAdditional RequirementsDue to contract requirements, applicants must be Canadian citizens or permanent residentsThe role is fully remote, BUT you are expected to be available during Eastern Time working hours. BenefitsGenerous stock option compensationTop-tier health and benefits coverageFully remote teamOpportunities to lead technical efforts as the team scales\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "application_url": "https://www.linkedin.com/jobs/view/4233827862",
      "seniority_level": "Mid-Senior level"
    },
    {
      "id": "4233901455",
      "title": "Machine Learning Engineer",
      "company": "ProNavigator",
      "location": "ProNavigator\n              \n\n\n              Toronto, Ontario, Canada",
      "description": "Who is ProNavigator?ProNavigator helps insurance organizations centralize, manage, and deliver on-demand information to sales, service, underwriting, and brokers/agents. In 2019, we pioneered the first knowledge management platform for insurance. Now, more than 10,000 insurance professionals use ProNavigator to get quick, accurate answers. We continue to push the boundaries of what’s possible by integrating large language models that are accurate and secure.At ProNavigator, we’re tackling and solving unique challenges. Every day is an exciting new opportunity to collaborate with colleagues as we build a leading-edge platform and support our clients to do their best work. Our culture is built on the values of hard work, creativity, collaboration and high performance. We’re looking for new team members who will try new things, share their opinion, move fast, think creatively and have fun.What’s this role all about?Join our Engineering team as they build the next generation of knowledge management products, powered by large language models. In this role you will play a leadership role in the design and development of AI software solutions and features, with a focus on researching, evaluating, training and tuning models to meet our product needs. This role is for you if you are a creative and scrappy problem solver who is looking to translate your technical depth in ML to provide technical direction and execution on language-based AI systems.Our current technology stack includes JavaScript, React, Python, FastAPI, Docker, AWS and MySQL, however we bring technologies in and out based on newly released tools, changes to requirements or solutions that more elegantly meet our objectives.Your accountabilities in this role will include:Delivering AI/ML models from initial planning to data sourcing and preparation, building and training models, and deploying models to production in our cloud environment, ideally using and deploying open source modelsCreating AI-based prototypes to evaluate model and design options, working with internal stakeholders to analyze quality and relevance of resultsTraining and tuning models to optimize outcomes of algorithmsIntegrating models to production, working with Engineering team members as needed to integrate models into product architectureWorking with internal stakeholders to understand product needs of AI and to scope potential solutionsConducting research into relevant AI models and technologies and staying well-connected to trends and developments in this rapidly evolving space This is a remote role that can be based from one of the following provinces in Canada: British Columbia, Alberta, Saskatchewan, Manitoba, Ontario, Newfoundland, PEI, New Brunswick, Nova Scotia.What do you need to be successful?The experiences, skills and attributes we think are key to your success are listed below. If you’re excited about this role but don’t meet 100% of these qualifications, we still encourage you to apply – we know there is no match for hunger, curiosity and an ability to figure things out in an evolving environment.5+ years of software development experience with at least 3 years of experience implementing ML and AI technologiesDeep knowledge of data modeling, and current ML and AI technologies with experience working with LLMs in particular to develop language-based solutionsHighly analytical with the ability to think outside of the box, consider potential solutions from many different sources and make decisions with rapidly evolving or ambiguous data pointsCreative and scrappy problem solver who is excited about the prospect of creating greenfield solutions using new and evolving technologies Strong written and verbal communication skills with the ability to present complex ideasHighly collaborative with the ability to work cross-functionally to understand needs and execute against ideasThrives in a startup environment where speed, agility and high performance are table stakesIf you need accommodations during the hiring process, let us know at any time and we’ll make sure you’re set up for success.What’s in it for you?We’re looking for the best of the best to join our team and in return, we invest in the things that are important to our team members including:4 weeks to give you the time away from work you need to recharge and deliver at 100%Flexible time off policies to support you when things come up outside of workRemote-first work environment that gives you the flexibility to work wherever you’re most productiveAnnual professional development budget so you can pursue growth in the areas related to your career goalsCompetitive total compensation package across salary, variable compensation and benefits\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "application_url": "https://www.linkedin.com/jobs/view/4233901455",
      "seniority_level": "Entry level"
    },
    {
      "id": "4232962029",
      "title": "Senior Data Scientist(GenAI)",
      "company": "Tiger Analytics",
      "location": "Tiger Analytics\n              \n\n\n              Toronto, Ontario, Canada",
      "description": "Tiger Analytics is looking for experienced Data Scientists to join our fast-growing advanced analytics consulting firm. Our consultants bring deep expertise in Data Science, Machine Learning and AI. We are the trusted analytics partner for multiple Fortune 500 companies, enabling them to generate business value from data. Our business value and leadership has been recognized by various market research firms, including Forrester and Gartner. We are looking for top-notch talent as we continue to build the best global analytics consulting team in the world.As a Data Scientist, you will apply strong expertise in AI through the use of machine learning, data mining, and information retrieval to design, prototype, and build next generation advanced analytics engines and services. You will collaborate with cross-functional teams and business partners to define the technical problem statement and hypotheses to test. You will develop efficient and accurate analytical models which mimic business decisions and incorporate those models into analytical data products and tools. You will have the opportunity to drive current and future strategy by leveraging your analytical skills as you ensure business value and communicate the results.Key ResponsibilitiesCollaborate with business partners to develop innovative solutions to meet objectives utilizing cutting edge techniques and toolsExperiment, evaluate, and create generative AI products for a variety of tasks, such as extracting data, summarizing documents, and other generative model applicationsUse fine tuning and advanced knowledge retrieval methods to improve the performance of generative AI models on specific tasksEvaluate the performance of models and make necessary improvementsCollaborate with other scientists, data engineers, machine learning operations engineers, prompt engineers, and product owners to develop generative AI productsEngineer features by using your business acumen to find new ways to combine disparate internal and external data sourcesShare your passion for Data Science with the broader enterprise community; identify and develop long-term processes, frameworks, tools, methods and standardsCollaborate, coach, and learn with a growing team of experienced Data Scientists. Stay connected with external sources of ideas through conferences and community engagementsRequirements5+ years of experience working as a GenAI Data ScienceExperience with Python from a functional programming paradigm, able to manage dependencies and virtual environments, along with version control in gitExperience with sequential algorithms (e.g., LSTM, RNN, transformer, etc.)Experience with Bedrock, JumpStart, HuggingFaceExperience evaluating ethical implications of AI and controlling for them (e.g., red-teaming)Expertise in supervised learning and unsupervised learning along with experience in deep learning and transfer learningExperience in generative algorithms (e.g., GAN, VAE, etc.) as well as pre-trained models (e.g., LLaMa, SAM, etc.)Experience developing models from inception to deploymentBenefitsThis position offers an excellent opportunity for significant career development in a fast-growing and challenging entrepreneurial environment with a high degree of individual responsibility.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "application_url": "https://www.linkedin.com/jobs/view/4232962029",
      "seniority_level": "Associate"
    },
    {
      "id": "4187676173",
      "title": "Senior Data Scientist",
      "company": "Coinbase",
      "location": "Coinbase\n              \n\n\n              Canada",
      "description": "Ready to be pushed beyond what you think you’re capable of?At Coinbase, our mission is to increase economic freedom in the world. It’s a massive, ambitious opportunity that demands the best of us, every day, as we build the emerging onchain platform — and with it, the future global financial system.To achieve our mission, we’re seeking a very specific candidate. We want someone who is passionate about our mission and who believes in the power of crypto and blockchain technology to update the financial system. We want someone who is eager to leave their mark on the world, who relishes the pressure and privilege of working with high caliber colleagues, and who actively seeks feedback to keep leveling up. We want someone who will run towards, not away from, solving the company’s hardest problems.Our work culture is intense and isn’t for everyone. But if you want to build the future alongside others who excel in their disciplines and expect the same from you, there’s no better place to be. Data is a critical component of Coinbase's strategy to optimize financial operations and enhance decision-making. In this role, you will collaborate closely with Finance, Product, and Engineering teams to support cash flow processes, including payments, cash reconciliations against bank statements, and safeguarding of assets. You will gather financial data from diverse sources, including platform data, external financial institutions, market data, and internal financial systems. By transforming raw data into meaningful insights, you will develop advanced data models and pipelines that drive analytics for understanding cash flowsWhat you’ll be doing (ie. job duties):Work with Product and Engineering to drive new initiatives, supporting new product launches fueling business growthHelp define data model, contract, scaling the build of data quality check and contract enforcementCollaborate with stakeholders across Accounting, Treasury and other Finance functions, to extract financial data and insights, and provide data driven recommendations to enhance efficiencies for financial processesAct as a strategic partner to functional teams; design and scope project plans; execute, test and implement data and reporting solutionsInitiate, develop and maintain data pipelines and data models that power dashboards and data products with outstanding craftsmanshipWork with the broader Data and Engineering teams to find ways to scale our platform through better systems and automationDevelop interactive dashboards and visualizations to present financial insights to stakeholdersPartner with peers and stakeholders to define and execute roadmaps that can help the function scaleWhat we look for in you (ie. job requirements):5+ years of relevant experienceSelf starter, has the ability to multitask, and highly collaborative in working with cross functional teamsStrong experience with data processing (ETL), fluency in complex SQL and basic programming language high proficiency with scripting language(preferably Python)Strong experience building data pipelinesknowledge of data modeling, architecture, best practicesExperience using Apache Airflow or similar orchestration systemsStrong understanding of key finance principles, products within Accounting and Treasury domain, and eagerness to learn Be able to independently create documentation for new data projects and requests, and build collaboration within the team.Demonstrate our core cultural values: clear communication, positive energy, continuous learning, act like an owner and efficient execution.Bachelor’s Degree in Engineering, Computer Science or equivalent practical experienceNice to haves:Previous experience working with financial services data is a plusPrevious working experience or knowledge of crypto is a plusDomain experience in Payments, Accounting and Finance areasExperience with Looker, Tableau or other business intelligence platformsBe able to proactively manage prioritization of workExperience manipulating large amounts of structured and unstructured dataJob ID: P61655 Pay Transparency Notice: The target annual salary for this position can range as detailed below. Full time offers from Coinbase also include target bonus + target equity + benefits (including medical, dental, and vision).Pay Range:: $180,370 CAD - $212,200 CAD Please be advised that each candidate may submit a maximum of four applications within any 30-day period. We encourage you to carefully evaluate how your skills and interests align with Coinbase's roles before applying.Commitment to Equal OpportunityCoinbase is committed to diversity in its workforce and is proud to be an Equal Opportunity Employer.  All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, sex, gender expression or identity, sexual orientation or any other basis protected by applicable law. Coinbase will also consider for employment qualified applicants with criminal histories in a manner consistent with applicable federal, state and local law.  For US applicants, you may view the Know Your Rights notice here.  Additionally, Coinbase participates in the E-Verify program in certain locations, as required by law. Coinbase is also committed to providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please contact us at accommodations[at]coinbase.com to let us know the nature of your request and your contact information.  For quick access to screen reading technology compatible with this site click here to download a free compatible screen reader (free step by step tutorial can be found here).Global Data Privacy Notice for Job Candidates and ApplicantsDepending on your location, the General Data Protection Regulation (GDPR) and California Consumer Privacy Act (CCPA) may regulate the way we manage the data of job applicants. Our full notice outlining how data will be processed as part of the application procedure for applicable locations is available here. By submitting your application, you are agreeing to our use and processing of your data as required. For US applicants only, by submitting your application you are agreeing to arbitration of disputes as outlined here.      \n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "application_url": "https://www.linkedin.com/jobs/view/4187676173",
      "seniority_level": "Mid-Senior level"
    },
    {
      "id": "4236141148",
      "title": "Senior Data Scientist – AI Platform",
      "company": "Stelvio Group",
      "location": "Stelvio Group\n              \n\n\n              Montreal, Quebec, Canada",
      "description": "Job Title: Senior Data Scientist – AI PlatformLocation: Montreal, Quebec - Fully RemoteJob Type: Full-TimeAbout the OpportunityJoin a forward-thinking organization pushing the boundaries of data science and artificial intelligence. We specialize in transforming unstructured document data into structured, actionable insights—powering smarter decisions across various business domains. As a Senior Data Scientist, you will play a central role in shaping the future of our AI technologies, working alongside top-tier talent to advance automation and intelligence across our data analytics platform.What You’ll DoLead the development and management of automated data processing workflows to optimize performance and accuracy.Design and enhance AI features within the platform to streamline analyst workflows and improve user experiences.Oversee and refine the AI Assistant to support users in understanding and interacting with data effectively.Partner with analysts and stakeholders to reduce reliance on manual processes through intelligent automation.Provide mentorship to junior team members and contribute to the growth of the Data Science function.Analyze AI system performance, delivering actionable insights and driving continuous improvement.Collaborate across international teams to innovate and refine AI-driven solutions.Operate with a high level of autonomy to identify, develop, and implement process enhancements.What We’re Looking ForAdvanced degree (Master’s or Ph.D.) in Computer Science or a related field.Demonstrated experience developing and deploying AI/ML models in production environments.Strong Python programming skills, including proficiency in Pandas, NumPy, SciPy, and Scikit-learn.Experience with Azure cloud services for AI deployment is a strong plus.Strategic thinker with strong problem-solving skills and attention to detail.Proven ability to work independently and lead innovation initiatives.Excellent communication skills for presenting findings and influencing data-driven decisions.Experience optimizing human-AI interactions and reducing manual data processing is highly valued.Fluent in English (spoken and written).Why Join Us?You’ll be part of a dynamic, collaborative team working on real-world problems with cutting-edge technology. This is your opportunity to take ownership of complex challenges, mentor others, and contribute to meaningful innovations that impact enterprise performance.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "application_url": "https://www.linkedin.com/jobs/view/4236141148",
      "seniority_level": "Associate"
    },
    {
      "id": "4233524892",
      "title": "AI / ML Engineer",
      "company": "Eon Media",
      "location": "Eon Media\n              \n\n\n              Ontario, Canada",
      "description": "AI/ML EngineerLocation: RemoteExperience: 2-3 YearsType: Contract (2 months), converting to Full-TimeAnnual Compensation: CAD $60,000 - $85,000 (Gross)Eon Media is looking for a skilled and dedicated AI / ML Engineer (fully hands-on development) to join our core development team. The position begins as a 2-month contract, after which it will convert to a full-time role based on performance. This is a hands-on engineering role focused on building backend systems using Python and deploying AI/ML models at scale. The possibilities of learning and implementing NextGen technologies are endless. This will be a unique career growth opportunity. You will work on real-world applications used by broadcasters and sports organizations across North America.Must-Have (This is required to succeed in the role)3+ years of Python experience in backend AI/ML developmentDeep understanding of various AI / ML Models (3+ years)Proficiency in Containers, Dockers, AWS EC2, S3, Lambda (2+ years)Good communication skills for effective collaborationAbility to work independently with transparency and accountabilityDedication and the ability to thrive in a fast-paced startup environmentResponsibilities:Develop backend solutions using AI / ML TechnologiesUtilize Python and other programming languagesDevelop API-based solutions and enhance the existing solution without using any 3rd party APIsOptimize and improve our existing software solutionsExpectations: This is not a fixed-schedule role. Extended hours may be required at times, depending on project deadlines, deliverables, and the pace of individual onboarding and learningCandidate should be prepared to adapt their working hours to meet critical milestones and team needs.Since this is a remote role, regular and proactive communication on work progress, challenges, and deliverables is expected and requiredYou may need to handle tasks outside your primary role depending on project needsTight deadlines and fast iterations are part of the workflowCompensation is structured for the role as a whole and is not tied to hours worked.CompanyAt Eon Media, we believe technology should simplify and enrich experiences for everyone. We are a small team of passionate and highly motivated individuals constantly innovating to solve complex problems in the simplest way possible.We believe in the remote-first approach. We occasionally meet up or on a need basis to work together as a team. We do this to brainstorm ideas, for drinks, games, or just to catch up. Our team works best remotely, independently but collaboratively, and determines their schedulesWe are an equal-opportunity employer and strongly encourage applicants of all backgrounds to apply. We are committed to building a diverse, inclusive, and respectful work environment.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "application_url": "https://www.linkedin.com/jobs/view/4233524892",
      "seniority_level": "Entry level"
    },
    {
      "id": "4234130476",
      "title": "Machine Learning Engineer",
      "company": "EA SPORTS",
      "location": "EA SPORTS\n              \n\n\n              Vancouver, British Columbia, Canada",
      "description": "Description & RequirementsElectronic Arts creates next-level entertainment experiences that inspire players and fans around the world. Here, everyone is part of the story. Part of a community that connects across the globe. A place where creativity thrives, new perspectives are invited, and ideas matter. A team where everyone makes play happen.EA SPORTS revolutionizes the world of gaming by driving transformational changes in how games are made and played. At EA SPORTS, everyone contributes to crafting the future of entertainment, building a community where creativity and innovation thrive.The EA SPORTS Catalyst Research and Innovation Team is dedicated to pioneering research that propels the gaming industry forward. We aim to redefine gaming experience by integrating innovative technologies and exploring new paradigms in game development. We focus on forward-looking experimentation and harness the latest technology to uncover what makes games fun for humans.As a Machine Learning Engineer, reporting to the Director of Technology, you will build the framework and tools necessary to drive our research strategy and innovation roadmap. You will work alongside our researchers to streamline their research and bring our innovations to life. Your mission is to redefine what is possible in gameplay by taking our team's research from concept to reality; empower experimentation, scaling up new discoveries, and contributing to a strategy that brings the future of gaming to life at EA SPORTS.This role is open to remote candidates.Your ResponsibilitiesImplement the technical strategy to support our research roadmap, exploring frontier technologies to shape the future of Sports GamingWork with the research team to support experiments with tooling and platforms, and data acquisition and managementFacilitate the sharing of results through prototypes and compelling interactive demonstrationsStay abreast of the latest advancements in relevant technologies and propose impactful projects to inspire creativityCollaborate with game teams to understand their technical needs and build strategies to scale and integrate new discoveriesCollaborate with a diverse range of partners, including research, engineering, and game development teamsYour QualificationsBS in Computer Science, mathematics or related field, or equivalent experienceStrong technical background, experience working with both research engineering and game development, and a proven track record of delivery3+ years of experience with AI and machine learning, their relevant tools and platforms, and their application in gamingExpertise turning new ideas into effective implementations.Compensation And BenefitsThe ranges listed below are what EA in good faith expects to pay applicants for this role in these locations at the time of this posting. If you reside in a different location, a recruiter will advise on the applicable range and benefits. Pay offered will be determined based on a number of relevant business and candidate factors (e.g. education, qualifications, certifications, experience, skills, geographic location, or business needs).PAY RANGES British Columbia (depending on location e.g. Vancouver vs. Victoria) * $115,100 - $161,200 CADIn British Columbia, we offer a package of benefits including vacation (3 weeks per year to start), 10 days per year of sick time, paid top-up to EI/QPIP benefits up to 100% of base salary when you welcome a new child (12 weeks for maternity, and 4 weeks for parental/adoption leave), extended health/dental/vision coverage, life insurance, disability insurance, retirement plan to regular full-time employees. Certain roles may also be eligible for bonus and equity.About Electronic ArtsWe’re proud to have an extensive portfolio of games and experiences, locations around the world, and opportunities across EA. We value adaptability, resilience, creativity, and curiosity. From leadership that brings out your potential, to creating space for learning and experimenting, we empower you to do great work and pursue opportunities for growth.We adopt a holistic approach to our benefits programs, emphasizing physical, emotional, financial, career, and community wellness to support a balanced life. Our packages are tailored to meet local needs and may include healthcare coverage, mental well-being support, retirement savings, paid time off, family leaves, complimentary games, and more. We nurture environments where our teams can always bring their best to what they do.Electronic Arts is an equal opportunity employer. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. We will also consider employment qualified applicants with criminal records in accordance with applicable law. EA also makes workplace accommodations for qualified individuals with disabilities as required by applicable law.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "application_url": "https://www.linkedin.com/jobs/view/4234130476",
      "seniority_level": "Entry level"
    },
    {
      "id": "4231687885",
      "title": "Senior AI/ML Engineer (Remote)",
      "company": "NEARSOURCE TECHNOLOGIES",
      "location": "NEARSOURCE TECHNOLOGIES\n              \n\n\n              Toronto, Ontario, Canada",
      "description": "We are hiring a Senior AI/ML Engineer (Remote) to join our team and drive data-driven decision-making across our digital platform. Apply now to be part of the team.Responsibilities:ML Model Development: Apply advanced machine learning techniques to understand customer behavior, drive product adoption, and improve user engagement.Pipeline Design & Implementation: Design, build, and maintain scalable machine learning pipelines to support product development and evidence-based decision-making.Cross-functional Collaboration: Partner with senior leaders across Product, Engineering, Product Marketing, and Design to ensure effective use of ML models for business impact.Data Analysis & Insights: Use data science and quantitative analysis techniques to influence product strategy, roadmap prioritization, and user experience improvements.Technical Leadership: Mentor and guide junior team members, ensuring best practices in model development, coding, and production deployment.ML-Driven Features: Deliver key ML-powered features for our Digital Customer Platform, ensuring high scalability, performance, and reliability.Minimum Qualifications:Educational Background: MS/PhD in Mathematics, Statistics, Computer Science, Physical Sciences, or a related quantitative field.Experience: 5+ years of industry experience working on ML-based solutions, from concept to production.Technical Skills:Proficiency with machine learning libraries and frameworks (TensorFlow, PyTorch, Scikit-learn, etc.).Hands-on experience with Large Language Models (LLMs), RAG (Retrieval-Augmented Generation), and Generative AI.Expertise in Natural Language Processing (NLP) for text analysis and understanding.Experience with big data platforms (Hadoop, Spark, Hive) and cloud environments (AWS preferred).Strong SQL and NoSQL database skills.Proficiency in at least one programming language (Python or Java).Experience with MLOps tools and techniques to streamline ML workflows and production deployment.APPLY NOW!NearSource Technologies values diversity and is committed to equal opportunity. All qualified applicants will be considered regardless of their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as protected veterans.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "application_url": "https://www.linkedin.com/jobs/view/4231687885",
      "seniority_level": "Mid-Senior level"
    }
  ]
}